{
    "products": [
        {
            "title": "Fastrack New Limitless FS1 Smart Watch|Biggest 1.95\" Horizon Curve...",
            "reviews": [
                {
                    "review_text": "I purchased it for Rs 2K. Given the price, I do not recommend or advise otherwise. I have listed below my experience with this watch. This will help buyers making informed buying choice.Pros:1. Big enough and looks good.2. Companion App with  your rank in your city and globally.3. Ability to send data to standard goole health app.4. Enough sports mode with parameters like aerobic training effect and required cooling time, step length etc. It gives you more insight about exercise.5. Custom watch face. Though it gives basic information only. Choosing display values would have been better.6. Mostly accurate steps, heart beat rate and SpO2. However, I find it gives lesser steps and distance covered if you walk fast. The gap is about 10%.7. Senses activity and prompts you to start tracking.8.Alexa for weather update etc.9. Music and camera control from watch.10. Enough bright under  sun at 100% nits.11. I assume data, micro code and app code control lies with fastrack(Tata). Better than giving data in control of Chinese companies.12. Silicon strap is good.13. Control of apps that can send messages to watch and display is good enough.14. The microphone and speaker are very good. You can really make good calls with this watch.15. Battery runs for 2-3 days with all tracking on and 60% brightness.Cons:1. The biggest issue is that automatic functions like spo2, sleep, stress etc. stop abruptly. Several times it did not record sleep, her, stress at all. I feel if you restart the watch everyday, it still works better.2. Sleep tracker gives basic values and looks like it  works for a specific period only. If you wake once even for nature's call, it stops tracking sleep. Overall, it's useless.3. Alexa disconnects automatically and needs to be setup again. Not sure if this is alexa app or something else but the user experience for this function is not that pleasant due to this issue4. The knob doesn't have scroll function. It rotates for nothing.5. Requires tight fitting to track values making it inconvenient to wear it for longer periods.6. Tucking the strap inside is inconvenient. Some other brands also have the same but it is not good for men with hairs on hand and watch requiring tight fit to track values. A conventional loop would be better.7. If you accidently replace a watch face with your custom face, it is impossible to bring it back. I am unable not find a way so far.8. No amoled screen. I personally do not think it is required for watch.In summary, if you do not rely on automatic functions and can provide manual inputs, not keen on tracking sleep and live with cons, it is worth a buy at this price tag else not.",
                    "review_time": "2023-05-12"
                },
                {
                    "review_text": "Watch in better in this range.1. All tracking function working correctly.2. You can see notification of apps.3. Battery backup is about 7 day in 20% brightness.4. IP68 is great in this watch, you can enjoy swimming with wearing this.Cons.1. it should be given inbuilt games.2. Full contact should be shown on phone directory.3. Other apps like WhatsApp, massage, should be install to read and reply.4. Hindi fort reading option should be given.",
                    "review_time": "2023-09-22"
                },
                {
                    "review_text": "Watch shows perfect time. there was issue in watch app, but solved by fastrack by giving update. Watch UI is laggy not that smooth. but amoled display in this price rocks. best fit for medium to large wrists. there are lots of watch faces, but customisation option for custom face is not that good. battery back up is good. works perfectly with my device. looks of this watch is good. call functionality helped me lot while driving. best buy if you get under ₹3k. packaging of watch by fastrack is good. but not listed on their official website. works perfectly with fastrack reflex app even mobile is on power saving mode. reduced one star for laggy UI.",
                    "review_time": "2023-09-10"
                },
                {
                    "review_text": "Liked it worth of money",
                    "review_time": "2023-09-26"
                },
                {
                    "review_text": "Nice looking and best quality parfact size",
                    "review_time": "2023-09-24"
                },
                {
                    "review_text": "Good",
                    "review_time": "2023-09-27"
                },
                {
                    "review_text": "I  liked product and quality",
                    "review_time": "2023-09-22"
                },
                {
                    "review_text": "Nice look and super product",
                    "review_time": "2023-09-20"
                },
                {
                    "review_text": "Value for money",
                    "review_time": "2023-09-20"
                },
                {
                    "review_text": "Good product in this price range...battery life also Good👍",
                    "review_time": "2023-09-14"
                },
                {
                    "review_text": "quality very best, value for money and long durability, noice quality and battery backup very good...... go and purchase this fast-track product and also gift to your loving one ... this is giftable product",
                    "review_time": "2023-09-04"
                },
                {
                    "review_text": "Nice product,sharp display but the negative point is its battery life due to always on display battery hardly lasts only 4 days,but value for money",
                    "review_time": "2023-09-11"
                },
                {
                    "review_text": "Everything is fine but iphone camera doesn't work with it.",
                    "review_time": "2023-09-17"
                },
                {
                    "review_text": "",
                    "review_time": "2023-09-15"
                },
                {
                    "review_text": "Good",
                    "review_time": "2023-09-14"
                },
                {
                    "review_text": "Product are very good.nice colour.full of features.",
                    "review_time": "2023-09-11"
                },
                {
                    "review_text": "Alexa calling not supported this watch",
                    "review_time": "2023-09-11"
                },
                {
                    "review_text": "Best quality love black 🖤 nice display 🤩 charge and all functions nice",
                    "review_time": "2023-09-05"
                },
                {
                    "review_text": "Everything is ok but battery does not last more than 4 days with minimum usage however fastrack is claiming battery for 7 days and there is fix always on display you can not use watch face of your choice.",
                    "review_time": "2023-08-30"
                },
                {
                    "review_text": "A good product to buy for...",
                    "review_time": "2023-09-05"
                },
                {
                    "review_text": "watch is little big in size and perfectly working with all the options. Great purchase",
                    "review_time": "2023-08-31"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Has a super duper watch",
                    "review_time": "2023-09-23"
                },
                {
                    "review_text": "Nice ,good ,",
                    "review_time": "2023-09-04"
                },
                {
                    "review_text": "Colour is not matching with the photo",
                    "review_time": "2023-08-31"
                },
                {
                    "review_text": "I like it, at this budget you can't expect more. The battery last easily five days with blue tooth connection. The over all show is also good. Doesn't look like under 4k product.",
                    "review_time": "2023-08-20"
                },
                {
                    "review_text": "Fast-track earned the money with the brand name, features of the watch does not worth the money at all.However the watch is good have some different features and looks as well but still not sure if over 3k is a worthwhile money for this product 🤔🙄",
                    "review_time": "2023-08-12"
                },
                {
                    "review_text": "Best watch at 3000 with brand...",
                    "review_time": "2023-08-25"
                },
                {
                    "review_text": "Overall I felt this product is good and has a great battery back up. However, I observe glich in the Bluetooth connection when on a call, as it won't allow for earpiece option but directly connects to watch. This delays in process of answering a call or sometimes people on the other side cannot hear (when watch is connected during the call) . I hope the team rectifies this bug.",
                    "review_time": "2023-08-02"
                },
                {
                    "review_text": "good product. comfortable, touching, sound, look all is okey...but its has only 20 sport activities not 100+ sports here...",
                    "review_time": "2023-08-24"
                },
                {
                    "review_text": "Good",
                    "review_time": "2023-08-26"
                },
                {
                    "review_text": "Nice",
                    "review_time": "2023-08-22"
                },
                {
                    "review_text": "Unfortunately the return window was only for 7 days.There is no clarity on Amazon on how to handle this failure now and no support details available.Other aspects of the watch are good, but a very basic functionality that everyone has already mastered is failing. And there’s no visibility of customer support either.Update: I went to the Titan store near my place and they took back the watch - no harassment at all. They also gave me a coupon to purchase another watch from the store. From the coupon that was offered, I could purchase another watch if similar specification from the store. It is working fine.Have changed the star rating of my feedback accordingly.",
                    "review_time": "2023-08-03"
                },
                {
                    "review_text": "The item is ok",
                    "review_time": "2023-08-21"
                },
                {
                    "review_text": "FGg",
                    "review_time": "2023-08-23"
                },
                {
                    "review_text": "Good one can buy",
                    "review_time": "2023-09-28"
                },
                {
                    "review_text": "",
                    "review_time": "2023-08-21"
                },
                {
                    "review_text": "Good in hand feel and very friendly user interface with quick response rate 👍🏻.....nice sound quality",
                    "review_time": "2023-08-09"
                },
                {
                    "review_text": "Likes:1. Good performance hardware2. No lag till now as promised3. Bluetooth hardware is latest so it doesn't disconnect itself from phone. Which is very important for a smart device.4. Strap quality is good.5. All available features working normal so not found any issue.6. Battery is running as promised days (with Bluetooth connectivity and Active calling function).7. Device Full charge in 2 hours which is good for 7-8 days battery life on moderate use.Dislike:1. Step counter is not accurate.2. Sleep tracking is quite accurate.3. Device doesn't have Screen Lock feature. It can be available on software updates.This is the review after 15days usage.If I found any issue or update, I will post here.If anyone want to purchase this Fastrack New Limitless FS1 smartwatch should not think twice, Just Go for It.",
                    "review_time": "2023-09-10"
                },
                {
                    "review_text": "I like the watch",
                    "review_time": "2023-08-16"
                },
                {
                    "review_text": "Nice and reasonable",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "Quality good, features good",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "Satisfactory",
                    "review_time": "2023-08-16"
                },
                {
                    "review_text": "It is looking very good but battery back up is very poor.Charge required every day.",
                    "review_time": "2023-09-14"
                },
                {
                    "review_text": "Value for money",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "This phone and app not connected",
                    "review_time": "2023-09-18"
                },
                {
                    "review_text": "Super watch",
                    "review_time": "2023-08-14"
                },
                {
                    "review_text": "Good product with great price",
                    "review_time": "2023-07-31"
                },
                {
                    "review_text": "Strap would have little wider according to my wrist,Let me use for a month and see the actual performance in hot temperature of middle east.",
                    "review_time": "2023-07-23"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Great  smartwatchIn this Price range",
                    "review_time": "2023-08-13"
                },
                {
                    "review_text": "Watch good looking wait less Amazing Battery backup is very good 👍",
                    "review_time": "2023-08-01"
                },
                {
                    "review_text": "The features of the watch is good but there’s one issue, it won’t show WhatsApp notifications",
                    "review_time": "2023-08-02"
                },
                {
                    "review_text": "Its looking lovely...",
                    "review_time": "2023-08-02"
                },
                {
                    "review_text": "It's ok good product",
                    "review_time": "2023-09-13"
                },
                {
                    "review_text": "Sleep tracking is not working on this watch.",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "A very good smartwatch at a reasonable price. Very good performance, I compared it with my previous smartwatch and found it good. Only complaint is about the smartwatch dials which are changeable through the fastrack app. These dials are singularly uninspiring and wierd. Need to give decent and useful dials rather than giving something funky.",
                    "review_time": "2023-09-29"
                },
                {
                    "review_text": "Batery backup not sutable",
                    "review_time": "2023-09-13"
                },
                {
                    "review_text": "The Fastrack New Limitless FS1 smartwatch offers an impressive combination of style and functionality. With its sleek design and customizable watch faces, it caters to a variety of tastes. The watch boasts a range of fitness tracking features, including heart rate monitoring, step counting, and sleep tracking, which can provide valuable insights into your health and well-being.The FS1's battery life is commendable, allowing you to use it throughout the day without frequent charging. Its compatibility with both Android and iOS devices ensures that most users can take advantage of its features without any compatibility issues. The inclusion of notifications for calls, messages, and social media updates helps you stay connected without needing to constantly check your phone.However, as with any smartwatch, there might be some room for improvement. Users might find the touch screen responsiveness a bit lacking at times, and the app ecosystem might not be as extensive as some other competitors. Additionally, the watch's accuracy in terms of health metrics can sometimes be a bit off compared to dedicated medical devices.In conclusion, the Fastrack New Limitless FS1 smartwatch offers a well-rounded package for those looking for a stylish and functional wearable. It's particularly suitable for individuals who want to keep track of their fitness goals and stay connected on the go. Just keep in mind its minor drawbacks and make sure they align with your needs and expectations.",
                    "review_time": "2023-08-18"
                },
                {
                    "review_text": "poor product quality",
                    "review_time": "2023-09-13"
                },
                {
                    "review_text": "There is a problem in closing the strap only its strap is a problem, overall it's worth it.",
                    "review_time": "2023-07-28"
                },
                {
                    "review_text": "A good smart watch under 2.5k segment. Display is bright enough and big. A problem is it count steps by the moving of hand. If I'm standing at one place, moving my hand, it would count my steps. It is the biggest problem in it. But overall smartwatch is good. If you are planning to buy this one, definitely go with it.!!!",
                    "review_time": "2023-07-07"
                },
                {
                    "review_text": "The Smartwatch offers standout features like a spacious screen, seamless Bluetooth calling, and reliable SPO2 health monitoring, as per 3day use.However, it falters with non-functional sleep tracking, inconsistent Alexa performance, and limited notification display, often requiring phone access to read full messages. Furthermore, the absence of a dual time zone watch face is a notable drawback for users needing multiple time references.",
                    "review_time": "2023-08-09"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Why 3/5 star is that Alexa not functioning properly, watch face not uploading only customise field functioning. Otherwise watch is ok",
                    "review_time": "2023-09-10"
                },
                {
                    "review_text": "Good watch all are ok in this price but one is battery drain litte soon",
                    "review_time": "2023-08-02"
                },
                {
                    "review_text": "So far i liked the most is the battery capaciry for last 15days am still not charged the watch once it is 100% chaged and it is still on 65%,  in built mic and speaker are both very good.",
                    "review_time": "2023-09-28"
                },
                {
                    "review_text": "Is this a unisex watch",
                    "review_time": "2023-07-23"
                },
                {
                    "review_text": "Nice",
                    "review_time": "2023-07-31"
                },
                {
                    "review_text": "Average Quality Product, Don't justify it Price Display not As Expected",
                    "review_time": "2023-09-07"
                },
                {
                    "review_text": "",
                    "review_time": "2023-09-04"
                },
                {
                    "review_text": "It's ok",
                    "review_time": "2023-08-31"
                },
                {
                    "review_text": "Operation is Slowly",
                    "review_time": "2023-08-30"
                },
                {
                    "review_text": "Pros:- Good batter performance- Worth for Money- Clear BT call functionCons :- The app is not connecting instantly.- Sleep Monitor not working Properly- 10 Contacts Only can sync- Call switch function missing- TWS connection function missing",
                    "review_time": "2023-07-03"
                },
                {
                    "review_text": "Quality of the product is very Good,but Some important features is missing...Battery Backup is very worst...Battery drained very fast....Otherwise good product",
                    "review_time": "2023-08-22"
                },
                {
                    "review_text": "For the first three day use , battery backup is just with standing for  only two and half days with continuous HR,call function and other options. Screen refresh rate is very low, so feeling laggy for scrolling and selecting any options.",
                    "review_time": "2023-08-09"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n 1. AMAZING display, best for people with a beefy body due to the 1.96\" size. Colourful and crisp screen.2. Built quality is as described ie SOLID, the metal is prone to scratches but there are ways around that.3. Universal 22mm straps fit this watch so I'm able to share these with ther family members.4. Full of features!5. Battery life is decent, should last 3 days full blast.6. Brand value of FastTrack, app interface and animated faces.I bought it for 2.5k, in this price range nothing beats the FS1 pro.",
                    "review_time": "2023-09-12"
                },
                {
                    "review_text": "The microphone quality is much good and I feel very happy with this microphone and I suggest all of to buy it. Thank you",
                    "review_time": "2023-09-29"
                },
                {
                    "review_text": "The app and the watch often get disconnected, even after replacing with new one faced same issue. Hence notifications do not land on watch. Some serious technical issue??? Otherwise,looks wise and all other features are good but it makes no sense to buy, when the most important feature is not working properly. For every 30 to 40 mins I have to open the app to connect, and then again switch off and on 'allow notification ' then it works for few mins..... Thanks to Amazon,they are refunding my money",
                    "review_time": "2023-07-28"
                },
                {
                    "review_text": "Quality of this watch in this price is unbelievable. Display is awesome works perfectly even in bright sun light . No lagging . M using it with iphone so 1 or 2 features are not working . Love the teal color . Suits my wrist .",
                    "review_time": "2023-09-18"
                },
                {
                    "review_text": "Looking excellent.Take a long to time full change.",
                    "review_time": "2023-08-22"
                },
                {
                    "review_text": "I have ordered this and then after reaching I have used it for 2-3 days after 3 days it's microphone stopped working. Then I had replaced it. After I receive the other one... The same issue and in this battery is draining faster.... Even I don't keep connected with my mobile. I just connect it for 15-20 min per day. Now I've to show it at showroom.",
                    "review_time": "2023-07-18"
                },
                {
                    "review_text": "Smart watch functionality is average, main issue is that whaen you are in a sub menu and you presses main button, insted of going back it just goes to main screen. I.e you can go one step forward in any menu but if you choose wrong option you have to start again.Second thing when i am pairing with my one plus mobile it get auto connect for some time, but soon the fastag application is failed to detect watch, even the phone is showing that watch is paired. In this situation i have to inpair watch then pair again. Its sad!",
                    "review_time": "2023-06-21"
                },
                {
                    "review_text": "If you're in the market for a new smartwatch, then look no further than the Fastrack New Limitless FS1 Smart Watch.  I've had the chance to test out this product for a while now, and I have to say, I'm thoroughly impressed.First of all, let's talk about the display. The biggest 1.95\" Horizon Curve Display is simply stunning. It's crystal clear and easy to read, even in bright sunlight. And the fact that it's a curved display means that you get an even better viewing experience.The watch also features SingleSync BT Calling v5.3, which means that you can take calls and talk to people directly from your wrist. It's incredibly convenient, and I love not having to take my phone out of my pocket every time I receive a call.Another fantastic feature is the built-in Alexa. With Alexa, you can ask for the weather, set reminders, and even control your smart home devices, all with just your voice. It's a great addition that makes the Fastrack New Limitless FS1 Smart Watch even more useful.And let's not forget about the battery life. With a mega 7-day battery, you won't have to worry about constantly charging your watch. This is especially important if you're someone who's always on the go and doesn't have time to charge their devices constantly.The ATS Chipset with Zero Lag is also a standout feature. The watch runs smoothly and quickly, and I've never experienced any lag or delays.With over 100 sports modes and 150+ watchfaces, the Fastrack New Limitless FS1 Smart Watch has something for everyone. Whether you're a runner, swimmer, or weightlifter, you'll find a sports mode that suits your needs. And with so many watchfaces to choose from, you can customize your watch to your heart's content.Overall, I highly recommend the Fastrack New Limitless FS1 Smart Watch. It's packed with features, has an impressive battery life, and looks great on your wrist. If you're in the market for a new smartwatch, this one should definitely be at the top of your list.",
                    "review_time": "2023-04-17"
                },
                {
                    "review_text": "Watch charging very slow and tuch screen slow working. calling sound slow",
                    "review_time": "2023-08-20"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Product is very good , but i want  to buy round dial after try this , its too big for my hand ,  there is no exchange policy …",
                    "review_time": "2023-08-20"
                },
                {
                    "review_text": "You can get a much better watch among the available options in other brand.1.Watch some times lags2.",
                    "review_time": "2023-08-17"
                },
                {
                    "review_text": "Battery 🔋 backup is osm",
                    "review_time": "2023-07-20"
                },
                {
                    "review_text": "A good product from Fastrack, all functions which are provided works perfectly. For those who are having problem with alexa pls connect the watch with a new upgraded android phone and it will work like a charm.",
                    "review_time": "2023-07-19"
                },
                {
                    "review_text": "It's note fare",
                    "review_time": "2023-08-20"
                },
                {
                    "review_text": "Very much satisfied by using this smartphone",
                    "review_time": "2023-09-22"
                },
                {
                    "review_text": "The design is too good i loved itAnd the feature of this watch is very good and you should buy it. Worth the price  product . You can track your health , stress and many more . Best product i have ever seen",
                    "review_time": "2023-08-29"
                },
                {
                    "review_text": "A very good display in budgetWatch connect with out any problem to the phone.",
                    "review_time": "2023-09-15"
                },
                {
                    "review_text": "Everything is fine except it doesn't match with the colour showing on the pic. It's totally different. Everything else is good.",
                    "review_time": "2023-08-02"
                },
                {
                    "review_text": "I got it in some high price...product is very good...best ever... Fastrack ♥️",
                    "review_time": "2023-09-18"
                },
                {
                    "review_text": "Product recieved as expected great 👍🏿",
                    "review_time": "2023-10-02"
                },
                {
                    "review_text": "Doesn't connect consistently with either ios or android. Good screen. Good battery life.",
                    "review_time": "2023-07-09"
                },
                {
                    "review_text": "Honestly, the best watch in this price segment. I'll cut to the chase, here are the things I like The app has all the features that I need in a simple manner. Overall, I give this a 5/5 because of the quality of the watch, the ease of use and the combination of a smooth display coupled with a responsive and easy to understand UI.I would totally recommend this!",
                    "review_time": "2023-08-29"
                },
                {
                    "review_text": "The starp design was not appropriate",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "Display quality superb amazing colours 1.96 amoled+arch display great look always on display fast charging I am happy ☺️ fast delivery 🚚 thnq Amazon good job",
                    "review_time": "2023-09-18"
                },
                {
                    "review_text": "Value for money display very good performance good all over very nice watch and smart",
                    "review_time": "2023-09-15"
                },
                {
                    "review_text": "Watch is good but strap size is not prctical if you want to change strap  dont have these size option any where in market not offline not onlinr so you have to stuck with same watch belt..",
                    "review_time": "2023-07-22"
                },
                {
                    "review_text": "Good packaging and promote delivery.",
                    "review_time": "2023-09-20"
                }
            ]
        },
        {
            "title": "Fire-Boltt Invincible Plus 1.43\" AMOLED Display Smartwatch with...",
            "reviews": [
                {
                    "review_text": "I recently purchased the Fire Boltt Invincible Plus Smart Watch, and I must say I'm quite impressed with what this budget-friendly smartwatch offers. Here's my detailed review:**Design and Build Quality (4/5):**The Fire Boltt Invincible Plus comes with a sleek and stylish design. It feels comfortable on the wrist, thanks to the adjustable silicone strap. The watch has a sturdy build, and it's surprisingly lightweight, making it perfect for daily wear.**Display (4/5):**The 1.7-inch HD touchscreen display is vibrant and easy to read, even in bright sunlight. The touch responsiveness is good, allowing you to navigate through menus and notifications effortlessly.**Features (4/5):**For its price point, the Fire Boltt Invincible Plus offers an impressive set of features. It covers all the basics you'd expect from a smartwatch, including heart rate monitoring, sleep tracking, step counting, and more. It even has IPX7 water resistance, so you don't have to worry about wearing it during workouts or in the rain.**Health Tracking (4/5):**The heart rate monitoring and sleep tracking features provide valuable insights into your health. The watch syncs with the companion app, allowing you to track your progress over time. It also has multiple sports modes for those who enjoy working out.**Battery Life (3.5/5):**The battery life is decent, lasting around 2-3 days on a single charge with moderate use. While not the best in its category, it's sufficient for most users.**Connectivity and Notifications (4/5):**The smartwatch pairs easily with your smartphone via Bluetooth. It delivers notifications for calls, messages, and app alerts, keeping you connected without needing to check your phone constantly.**Companion App (3.5/5):**The Fire Boltt app is user-friendly and provides a clear overview of your health and fitness data. However, there's room for improvement in terms of additional features and customization.**Value for Money (4.5/5):**One of the standout aspects of the Fire Boltt Invincible Plus is its affordability. It offers a solid set of features and performance that you'd expect from a more expensive smartwatch.**Conclusion:**The Fire Boltt Invincible Plus Smart Watch is a fantastic value for the price. While it may not have all the bells and whistles of premium smartwatches, it covers the essentials well and looks great on your wrist. If you're on a budget and looking for a reliable and stylish smartwatch, the Fire Boltt Invincible Plus is a solid choice.Overall Rating: 4/5I hope this review helps you in making an informed decision about your Fire Boltt Invincible Plus Smart Watch purchase!",
                    "review_time": "2023-09-19"
                },
                {
                    "review_text": "Reviewing after 10 days of usagePositive:- a budget smartwatch with heavy build quality, rich specifications- decent battery life. With Bluetooth mostly off, I got 4 days of battery time (58% to 17%). Charged to 93%, all day Bluetooth and calls, every 5 minutes health monitoring on, battery lasted for almost 3.75 days (93% to 17%).- Many features, but rarely you are going to use much.- a handy calculator is a plus. But I found some difficulty in calculating more numbers. Like, 12345+2345+345.....- smooth functioning- local songs on tws is easy and better- mic and speaker are better- 4gb memory is really fantasticNegatives -These are not actually negative points. But there is a room for improvement in these issues.- You will never be able to listen to local songs on tws, in addition to getting calls. Example, SW is connected with your headphone. You play songs on headphone. At this time your SW will not be connected to Phone. So you can't get calls on SW.Same way, if you are connected with phone Bluetooth, you can't listen to local songs on headphone.- your steps get counted while driving. Even if you go to sports mode and select driving now. It will count steps. That adds it to total day steps and your calculations goes wrong.- there is no option to turn off call ringer, except puting it on DND.- While on local mode, it should just show calls, I found that it is automatically picking calls within a sec of call received. (I will need to check this again)- 500 sports mode is useless thing. One should be able to select the required modes on app. Only those will be shown on the SW. Otherwise you need 5 minutes to find the correct mode for you.- add stress measurement sensor- not showing main screen when you have a password protection on. Just shows time.- double tap to on screen is a much required feature for SW.- improvement in app required",
                    "review_time": "2023-09-25"
                },
                {
                    "review_text": "I recently purchased the Fire Boltt Invincible Plus Smart Watch, and I must say I'm quite impressed with what this budget-friendly smartwatch offers. Here's my detailed review:**Design and Build Quality (4/5):**The Fire Boltt Invincible Plus comes with a sleek and stylish design. It feels comfortable on the wrist, thanks to the adjustable silicone strap. The watch has a sturdy build, and it's surprisingly lightweight, making it perfect for daily wear.**Display (4/5):**The 1.7-inch HD touchscreen display is vibrant and easy to read, even in bright sunlight. The touch responsiveness is good, allowing you to navigate through menus and notifications effortlessly.**Features (4/5):**For its price point, the Fire Boltt Invincible Plus offers an impressive set of features. It covers all the basics you'd expect from a smartwatch, including heart rate monitoring, sleep tracking, step counting, and more. It even has IPX7 water resistance, so you don't have to worry about wearing it during workouts or in the rain.**Health Tracking (4/5):**The heart rate monitoring and sleep tracking features provide valuable insights into your health. The watch syncs with the companion app, allowing you to track your progress over time. It also has multiple sports modes for those who enjoy working out.**Battery Life (3.5/5):**The battery life is decent, lasting around 2-3 days on a single charge with moderate use. While not the best in its category, it's sufficient for most users.**Connectivity and Notifications (4/5):**The smartwatch pairs easily with your smartphone via Bluetooth. It delivers notifications for calls, messages, and app alerts, keeping you connected without needing to check your phone constantly.**Companion App (3.5/5):**The Fire Boltt app is user-friendly and provides a clear overview of your health and fitness data. However, there's room for improvement in terms of additional features and customization.**Value for Money (4.5/5):**One of the standout aspects of the Fire Boltt Invincible Plus is its affordability. It offers a solid set of features and performance that you'd expect from a more expensive smartwatch.**Conclusion:**The Fire Boltt Invincible Plus Smart Watch is a fantastic value for the price. While it may not have all the bells and whistles of premium smartwatches, it covers the essentials well and looks great on your wrist. If you're on a budget and looking for a reliable and stylish smartwatch, the Fire Boltt Invincible Plus is a solid choice.Overall Rating: 4/5I hope this review helps you in making an informed decision about your Fire Boltt Invincible Plus Smart Watch purchase!",
                    "review_time": "2023-09-10"
                },
                {
                    "review_text": "Please keep this in mind, watch is too good but mobile application is too bad. Nobody addressed the review comments in Google Play Store. Now I am bit worried about the after sales services because all the Play Store users put negative reviews and application rating is below 3 starts, even though there is no response from company's side. App doesn't have Google fit connect or any thing like that, I don't know what the use of that app. It's only useful for Bluetooth calling and call notification. If you're okay with mobile application please go ahead and purchase this watch, because watch is good.",
                    "review_time": "2023-10-01"
                },
                {
                    "review_text": "I am totally amazed by the features, battery life of this smart watch.A seamless Blue Tooth calling feature which makes picking calls so accessible from the watch.It has Al voice assistant which listens to my every command !The AMOLED display is very clear & it gives decent brightness in the sun.The watch is comfortable to wear all day (and night) and looks very stylish. Setup is easy. The downloadable da fit app allows for easy configuration of the smart watch.The fitness features work very well and accurately - pedometer, heart rate, calories etc. The sleep tracker also records your deep/light sleep patterns. All features work as advertised. Sports settings work well - I have used it for running and cycling with accurate recording.This is a genuine investment and one should definitely go ahead purchasing this smart watch.",
                    "review_time": "2023-09-09"
                },
                {
                    "review_text": "I appreciate the ability to customize watch faces and app notifications to suit my style and preferences. It's a big dial, but it adds a personal touch to the deviceAnd Considering the quality and features, I believe this smartwatch offers excellent value for money. It competes admirably with higher-priced alternatives on the market.Thank you fire bolt❤️❤️",
                    "review_time": "2023-10-01"
                },
                {
                    "review_text": "Having using the product for last 2 months. The finish and look is quite good,battery backup is low (max 2 days) without using any other utilities. Sports mode are decent ,accuracy are limited. Good for using as a watch,but not for other utilities.",
                    "review_time": "2023-10-01"
                },
                {
                    "review_text": "Worked well, the ui can be improved as it is only 60hz when on the main slides rather than the main menu, then it switches to 30hz which feels laggy in comparison. Otherwise its fine",
                    "review_time": "2023-10-03"
                },
                {
                    "review_text": "Very good Performance.Quick Response to calling.Battery standby is goodSize is perfect for men's and also for womens if we change pink strap.Sleep tracking is accurate.Not sure about durability.But extra strap not provided from fireboltt.",
                    "review_time": "2023-09-28"
                },
                {
                    "review_text": "The product is good. It works well. Though it emitts red and green light when not in use. But I like the watch.",
                    "review_time": "2023-08-12"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Watch is nice. Premium look.But it need some major technical fixes. No sure if firebolt will look into them??Issues:1. You will not get a silicon strap as claimed by firebolt. --- this was major reason for buying it.2. AOD has very low brightness. Not visible on sunny day.3. When you try controlling music from phone mode -- Song plays on watch -- that should not happen....instead it should control music playing on mobile -- Major Bug.4. You can't use tws along with phone mode -- eg -- when call come....you can only answer on watch...not on Tws.5. Custom wallpaper is not having all fetures to add...Please make it more customiseable.Also, we can customise exsisting wall papers.....It should be fixed.Only one wallpaper is effective having all features displyed as shown above.",
                    "review_time": "2023-07-13"
                },
                {
                    "review_text": "This watch is a perfect choice for those looking for a smartwatch with the looks of a formal analog one as it offers the stainless steel strap otpions too. Just a suggestion to the brand, to give the tool to adjust the steel strap in the box itself as one would need to visit a shop in case the steel strap is too big for their arm to shorten it. Also, didn’t recieve a silicon strap which is included for free with the steel strap IN THE BOX as mentioned on the internet…",
                    "review_time": "2023-07-20"
                },
                {
                    "review_text": "Used product for one day . As of now everything is good. Overall Good experience.Needed 5ATM Water resistance in this price category",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "I bought watch with Gold SS and its really have watch.Display is bigFirebotl has stop providing additional strap, this is confirmed by Customer care.Battery is OK.Will update review after my uses.",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "The product wise it is very good. I have searched so much to buy a smart watch. Finally I have chosen this. At this price range, there are many features available in this watch.Only thing I had bad experience with the battery life. After one month use the battery got discharged. I have given it for replacement at the service centre. It took 2 months for the replacement. It is a horrible experience. That's the reason I have given one star less for this watch. Firebolt you need to take care of this at  priority. Otherwise you may loose good no of customers. Take care.",
                    "review_time": "2023-07-16"
                },
                {
                    "review_text": "This watch has most of the features for its valueIt works well but there are some issues in it1.it lags too much in its menu screen.2. The rotating crown doesn't work well after 2-3 months.Afterall watch is worth it",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "Little bit disappointed to see that there is no silicon strap inside the box as some reviews mentioned they got the silicon strap too.It's too early to comment on the product quality.Will update after using it. First impression is looking really nice.",
                    "review_time": "2023-08-09"
                },
                {
                    "review_text": "Very good but there is a speaker in the watch and find my watch only vibration if you add sound it will be good",
                    "review_time": "2023-10-03"
                },
                {
                    "review_text": "It is a good product with plenty of customizations involved and also easy to use. But steps count is inaccurate",
                    "review_time": "2023-08-16"
                },
                {
                    "review_text": "The product is impressive, has a very clear display and is fast while moving among functionalities.It is a little bulkier (Bigger dial, specially the thickness) but gives a nice sporty look",
                    "review_time": "2023-08-08"
                },
                {
                    "review_text": "My experience after 2 days1- The mic quality2-Battry performance is decent not that much as for company claim3- 60Hz screen but when you use it feels like 30Hz4- Touch response is not that great sometime it won't workOverall its a good product at this price range",
                    "review_time": "2023-07-21"
                },
                {
                    "review_text": "A good looking smart watch... software update is very much required as watch gets automatic connect for voice call though I opt out.",
                    "review_time": "2023-08-14"
                },
                {
                    "review_text": "Still in great condition after a month, battery lasts 3 days even after heavy playing songs and playing games. The speaker quality is good too. And the connection is very fast and smooth especially with the earphones and speakers. But if you are serious about fitness tracking then it is very inaccurate in almost everything. Also, very cool features but the software could be more optimised to utilize its full capabilities.",
                    "review_time": "2023-07-28"
                },
                {
                    "review_text": "The invincible plus is just a awesome smartwatch from a affordable cost. display is super clear and easy to read texts on the go. Gifted for my cousin and he liked it for it's lot of features. Steps counted  and other health related data are accurate and overall very good so far !!",
                    "review_time": "2023-07-30"
                },
                {
                    "review_text": "The watch is of excellent build quality. The dial is of metal and large. Men with large wrist willfind it very suitable. Resolution is also crisp and clearResponse time is also fast. Battery support is also looks good. I am wearing for last 5 days and battery shows 55%. Overall satisfied with this purchase",
                    "review_time": "2023-07-27"
                },
                {
                    "review_text": "Its a nice, decent, value for money productOnly limitation i see is quick reply to notifications is missing",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "The smartwatch has good features but the software is the problem although it has a 60hz display the software can only display 15 frames a second it’s not very smooth and sometimes it changes to mobile mode even if it is in local mode and wastes battery life. I’m not even writing this review because I want to if I want to claim warranty I have to write a review here. I purchased the watch on 22nd June but the screen suddenly became all white and it’s not fixing itself even on restart.",
                    "review_time": "2023-07-22"
                },
                {
                    "review_text": "Very good watch, nice amoled screen the screen is very good the display is very contrasty the colours are very vidrant and the darks are very dark the quality is very good the vibration is very good.the watch looks very premium",
                    "review_time": "2023-07-22"
                },
                {
                    "review_text": "The Product is good in design and features and looks good, only thing if the steel strap could have glossy and brushed finish it might have the ultimate finish..",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "It's performing good so far with some minor shortcomings here and there but overall, a good choice.",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "Overall good but you should also provide silicon belt with this package for better experience and also add menstruation cycle",
                    "review_time": "2023-08-16"
                },
                {
                    "review_text": "I like this watch because it armed  heart rate sensor, blood pressure monitor and some of the other tracker",
                    "review_time": "2023-08-16"
                },
                {
                    "review_text": "it an excellent choice for those looking for a reliable entry-level smartwatch.I love it & I'm very excited to use this watch",
                    "review_time": "2023-10-01"
                },
                {
                    "review_text": "Awesome product by boult if you looking for something luxury then go for it without any hesitation",
                    "review_time": "2023-08-10"
                },
                {
                    "review_text": "Very good watch but the UI is a bit laggy.other than that it's a great watch ♥️",
                    "review_time": "2023-08-04"
                },
                {
                    "review_text": "Recd the product today. Gr8 looks & features. Performance can be commented only after some usage.",
                    "review_time": "2023-08-19"
                },
                {
                    "review_text": "The product is good but there are some issues with the screen shattering and lag problem",
                    "review_time": "2023-08-21"
                },
                {
                    "review_text": "The smart watch is really nice. Very user friendly. I liked it soooo very much.",
                    "review_time": "2023-08-18"
                },
                {
                    "review_text": "I love the product but the problem was with screen on function. The censors are doing it properly. Apart from that, I'll suggest thus beauty to anybody. And one more think I didn't got the extra silicon strap for steel type watch. I'm not satisfied with that.Thank you 😊",
                    "review_time": "2023-08-10"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Its a mixed review of watch speaker rating is 1 out of 5 vibration quality is 2/5 battery is 2/5  major FB provide screen guard for this 5k price and another rubber strap has be provide for this amount Noise can provided for those watches...at last speaker quality very poor even 1k watch speakers are better than this FB kindly improve these and majore provide one more rubber strap",
                    "review_time": "2023-08-24"
                },
                {
                    "review_text": "It's brilliant both by Looks and performance, it's faster, smoother and elegant in performance, 60Hz refresh rate makes it hassle free.Cool display, great sport modes.",
                    "review_time": "2023-08-15"
                },
                {
                    "review_text": "Screen resolution was good, but overall watch performance was average. Need improvement in the Android app for better user experience!",
                    "review_time": "2023-10-03"
                },
                {
                    "review_text": "Hlooo.... I've recieved the watch today....and it's better than the smartwatches that I used before....",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "Good watch for the price with good display, but touch could be a little bit smoother",
                    "review_time": "2023-08-07"
                },
                {
                    "review_text": "Overall it's quite good. Could have increased the battery life a bit. I would recommend to buy it.",
                    "review_time": "2023-10-01"
                },
                {
                    "review_text": "If you are looking for a good smartwatch aroubd 5k price range then is the one.",
                    "review_time": "2023-08-04"
                },
                {
                    "review_text": "over all good. but cannot use raise to wake  and display always on at the same time.also connecting using QR code never worked for me",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "Just got it today. Easy to connect with mobile and starts functioning once connected. Light weight, can be used for longer hours. Overall happy. Hope this will continue for long run. Lots of other features like blood pressure, spo2, heart rate etc. Activated immediately though readings yet to be verified.",
                    "review_time": "2023-07-17"
                },
                {
                    "review_text": "Good product, I just love it. I ordered Metal black case one but in the box was missing with free silicone strap inside. Still this smartwatch nice.",
                    "review_time": "2023-08-15"
                },
                {
                    "review_text": "Recently received it....just started using it...Looks are very good...Features are great for this price.",
                    "review_time": "2023-08-19"
                },
                {
                    "review_text": "A good and stylish smart watchPros:1. Luxury feel in a good price range: This watch has cool metallic body with functional crown and two function buttons with red lining, this gives a premium feel on hands.2. Almost accurate health monitoring: The heart rate, sleep, and spo2 monitoring is 90-95% accurate and provides enough info for an on the go check3. Display: The display is bright enough and has a punch to its color, the amoled display is surely good at this price4. Features like calculator, recorder, always on display, lock, games and songs are a good addition to this watch5. The storage in this watch is more than enough to store songs and recordings  and has a  good and loud speaker with easy controlsCons:1. The small display and bezels are a let down: The display quality is surely good but the display size is small, the additional bezels are a bit let down2. The straps: The metallic straps are good but the silicon straps are low quality3. The watch faces: Although the amount of watch faces are good and it supports live watch faces but the live watch faces hang in between and are glitchy and the refresh rate is low and the pre installed watch faces are not that good and u can't even change them.Overall the watch is good and is surely a must buy if u are looking for a good budget watch that gives premium feel⭐⭐⭐⭐",
                    "review_time": "2023-06-06"
                },
                {
                    "review_text": "Writing this review after 3 months of using this. And it has been really great experience. Battery backup is great. It has so much features that i am yet to use all of them.Fully satisfied.",
                    "review_time": "2023-07-31"
                },
                {
                    "review_text": "You cannot silent incoming calls from watch. you might face problem if you haven't set sim card preference on mobile, but you can prevent this by setting sim preference",
                    "review_time": "2023-08-13"
                },
                {
                    "review_text": "Product is good but in my case, battery is not working for the last month",
                    "review_time": "2023-08-03"
                },
                {
                    "review_text": "A decent product for the value of money don't expect exact accuracy for reading steps.",
                    "review_time": "2023-08-02"
                },
                {
                    "review_text": "Good product but ui is very laggy and Charging it is a pain as the charger keeps on disconnected. Overall good enough for the price.",
                    "review_time": "2023-08-17"
                },
                {
                    "review_text": "I bought this watch so I can listen musics at my office also the design brought my attention",
                    "review_time": "2023-08-05"
                },
                {
                    "review_text": "Watch is good, there is no problem about the watch it's pretty good",
                    "review_time": "2023-08-13"
                },
                {
                    "review_text": "The bulit quality is good and good amount of features for this price category",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "It's been few days using this product, so far happy with the display and it's features.",
                    "review_time": "2023-08-19"
                },
                {
                    "review_text": "review after using for 7 days - The display is great, it does all the basic functions well. If it is available under 4k, go for it.. no other watch comes with so many features.",
                    "review_time": "2023-08-23"
                },
                {
                    "review_text": "Looks marvelous on wrist, many face and can make as our choice.Best in a range .",
                    "review_time": "2023-08-06"
                },
                {
                    "review_text": "Impressed with the build quality and its features in this price range. Will use it for a few days and drop the detailed review",
                    "review_time": "2023-08-08"
                },
                {
                    "review_text": "Pretty decent watch by fire bolt. Giving a steel touch makes it feel more premium.Also wanted to add the watch was out of stock for a very long time. As I was patient enough to buy the watch but many people won't wait for it as everyday new smart watches are coming in market.Also I was shocked that I didn't get the pair of normal strap with the watch. After that I have ordered the steel variant of the watch and accordingly to my knowledge in the box we get normal strap but I didn't find one. So was disappointed a little.Overall great watch but need improvement in application.",
                    "review_time": "2023-06-22"
                },
                {
                    "review_text": "As of now it's good. Let me use and update the review comments.",
                    "review_time": "2023-08-12"
                },
                {
                    "review_text": "Full metal body with great display ,sound, battery everything.  Just one thing its little big so see uploaded photos of someones and buy",
                    "review_time": "2023-07-30"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Purchased FB Invincible Plus in Amazon sale on 16-Jul-23 for ₹4,899-₹100 coupon+extended warranty for ₹149.Review after about 5 days of constant wearing,Metal strap, fits well after removing 3 links,battery still holding at 13% without a single recharge,BT connectivity is great,location tracking is good,Heart rate  /Pulse Oxy/BP are good,step tracking not bad,sleep tracking is still not working.Calling and music are alright.Overall a good product at attractive price point. 4/5 Stars.",
                    "review_time": "2023-07-23"
                },
                {
                    "review_text": "It's good for tracking workout analysis, sleep patterns, and many more features.",
                    "review_time": "2023-08-16"
                },
                {
                    "review_text": "Product is good ..I like the style and quality of product.",
                    "review_time": "2023-08-20"
                },
                {
                    "review_text": "Under this budget this one product is good. Facing charging difficulties",
                    "review_time": "2023-08-14"
                },
                {
                    "review_text": "The media could not be loaded.\n                \n\n\n\n Good product which has multiple options with the price range. Best part about it is that it looks great but one thing I would like to point is that it is not very smooth in functioning so it’s one of the things that can be improved.Phone application is something I feel there should be further improvement. Battery backup is excellent. I bought the one with black metallic strap and I was expecting the silicone strap to come along with that but that is missing. That's the reason it's 4 star.",
                    "review_time": "2023-07-18"
                },
                {
                    "review_text": "Premium looking smart watch with most of the features in the price range.",
                    "review_time": "2023-08-20"
                },
                {
                    "review_text": "Very classy with steel strap. Suitable for formal and casual attire.",
                    "review_time": "2023-08-12"
                },
                {
                    "review_text": "But the only thing is I did not get any silicon strap inside the box.",
                    "review_time": "2023-10-01"
                },
                {
                    "review_text": "Its a great product but they should have given an extra option to only control the music on the phone as when I try that it starts to play the music on the watch which I dont want I just want to skip the music.",
                    "review_time": "2023-08-15"
                },
                {
                    "review_text": "Great watch with bundle of features and battery life good",
                    "review_time": "2023-08-19"
                },
                {
                    "review_text": "It has an Elegant strap, light weight, smooth Touch, I like it.",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "It's a very good product and would definitely tell others to buy.... It had all the features they have mentioned in description. The Bluetooth calling featur is very useful for answering calls during hectic times. It also has cool features like voice assistant, weather report,and etc... It has not 1 but 1000 sports mode which can be used for tracking our health fitness and also SPO2 sensor which shows our heart rate and also how high or low we are breathing... It also supports social media applications like WhatsApp,Insta, FBetc.. it also tracks our steps, calorie burnt and blood oxygen levels..",
                    "review_time": "2023-07-01"
                },
                {
                    "review_text": "Good smart watch ,and so many great features in this watch..",
                    "review_time": "2023-08-26"
                },
                {
                    "review_text": "Got it today, Enviable looks, will wait and see it's functioning in the coming days.",
                    "review_time": "2023-08-03"
                },
                {
                    "review_text": "Pros:Good one in this segment, feature loaded and a good looking watch.Cons:User experience can be better in terms of the firebolt mobile app,Display touch actions can be little smootherOverall experience:A good looking watch in 5k segment with all the updated features",
                    "review_time": "2023-08-22"
                },
                {
                    "review_text": "The Fire Boltt smartwatch is a true marvel of modern technology. Its sleek design seamlessly blends fashion and functionality, making it a wonderful accessory for anyone. The vibrant, high-resolution display is a visual delight, providing crystal-clear access to a wealth of information at your wrist.But it's not just about looks; the Fire Boltt smartwatch is a powerhouse of features. From tracking your health and fitness goals with precision to keeping you connected with notifications from your smartphone, it's a versatile companion for the modern lifestyle.What truly sets the Fire Boltt apart is its attention to detail. Its robust battery life ensures that you won't be constantly searching for a charger, and the user-friendly interface makes navigation a breeze. With its water-resistant build, you can take it anywhere, from the gym to the great outdoors, without worry.In a world of smartwatches, the Fire Boltt stands out as a testament to innovation and elegance. It's not just a timepiece; it's a statement of sophistication and convenience that enhances your daily life. Whether you're a tech enthusiast or simply seeking a stylish way to stay connected, the Fire Boltt smartwatch is a wonderful choice that ticks all the right boxes.",
                    "review_time": "2023-09-13"
                },
                {
                    "review_text": "Nice watch with amazing features at this price. Super built quality.",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "Good product but my watch display not working after 1 week",
                    "review_time": "2023-08-28"
                },
                {
                    "review_text": "Watch is very good but pls improve the charger cable. Because did not connect properly.",
                    "review_time": "2023-08-07"
                },
                {
                    "review_text": "I like it very much. Display isAMOLED which gives bright colours and full dark. I think chain quality should be improve",
                    "review_time": "2023-08-01"
                },
                {
                    "review_text": "The product is awesome and it works good",
                    "review_time": "2023-08-19"
                },
                {
                    "review_text": "I recently purchased the Firebolt watch and I must say, I am thoroughly impressed with its performance and features. This watch is a true game-changer in the world of smartwatches.Firstly, the design of the Firebolt watch is sleek and stylish. It has a modern and minimalist look that can easily complement any outfit, whether it's a casual day out or a formal event. The build quality is exceptional, with a durable stainless steel case and a scratch-resistant sapphire crystal display, ensuring that it can withstand everyday wear and tear.One of the standout features of the Firebolt watch is its vibrant and sharp AMOLED display. The colors are incredibly vivid, making it a pleasure to view notifications, messages, and other information on the screen. The touch responsiveness is also top-notch, making navigation through menus and apps a breeze.In terms of functionality, the Firebolt watch truly excels. It seamlessly connects to my smartphone via Bluetooth, allowing me to receive notifications for calls, messages, emails, and social media updates directly on my wrist. The watch also has a built-in microphone and speaker, enabling me to make and receive calls without needing to take out my phone.The fitness tracking capabilities of the Firebolt watch are also worth mentioning. It accurately tracks my steps, distance, calories burned, and heart rate throughout the day. The watch also offers various workout modes, including running, cycling, and swimming, providing real-time data to help me monitor my progress and achieve my fitness goals.Battery life is another area where the Firebolt watch shines. With regular use, I can easily go two to three days without needing to recharge. This is impressive considering the vibrant display and the multitude of features packed into this watch.Overall, I am extremely satisfied with my purchase of the Firebolt watch. It offers a perfect balance between style and functionality, making it an excellent choice for anyone in need of a high-quality smartwatch. Whether you're a fitness enthusiast, a busy professional, or simply someone who appreciates a well-designed timepiece, the Firebolt watch is definitely worth considering.",
                    "review_time": "2023-08-23"
                },
                {
                    "review_text": "I liked the many inbuilt watch faces which is cool",
                    "review_time": "2023-08-22"
                },
                {
                    "review_text": "Good watch but I think गोरिल्ला glass protection bhi hona chahiye bahut scratches aate h.",
                    "review_time": "2023-09-01"
                },
                {
                    "review_text": "Perfect combination of classic look and smart watch.Looking so nice",
                    "review_time": "2023-08-07"
                },
                {
                    "review_text": "Screen quality is good, at this price battery is also good",
                    "review_time": "2023-08-31"
                },
                {
                    "review_text": "Pros:1) Nice display and lot of watch faces.2) heart rate is accurateCons1) App is not very good2) Steps tracking is highly inaccurate",
                    "review_time": "2023-08-05"
                },
                {
                    "review_text": "Kuch din chalane ke baad achanak band ho Gaya hai on nahi ho Raha 😔",
                    "review_time": "2023-08-11"
                },
                {
                    "review_text": "Watch is good. You can buy it without any doubt.",
                    "review_time": "2023-08-14"
                },
                {
                    "review_text": "Features are good and the bluetooth calling is clear as mentioned. Satisfied with the first look.",
                    "review_time": "2023-08-17"
                },
                {
                    "review_text": "Best Watch Under 10000.4GB internal storage is extraordinary. Rare and Unique",
                    "review_time": "2023-08-05"
                },
                {
                    "review_text": "The watch is beautiful and the display is also good",
                    "review_time": "2023-08-07"
                },
                {
                    "review_text": "This is a good smartwatch in this range and is value for money. Main attractions for me would be the music player which can connect with phone or earbuds and can also play locally stored songs on the built-in speaker or earbuds. It also has feature for receiving calls and also making calls. It can also receive notifications from apps like Whatsapp on your mobile.It also has other good features like body parameters measurement like heart rate etc. It also has some small games which you can play when bored. It also has modes for various activities you can explore.",
                    "review_time": "2023-08-03"
                },
                {
                    "review_text": "I have recently  purchased  it looks good to  me it is worthy am happy with look and feel. Charging everything  need some more days to check by usage",
                    "review_time": "2023-07-27"
                }
            ]
        }
    ]
}